# DO NOT ADD OR CREATE ANY NEW CELLS
## DO NOT ADD OR CREATE ANY NEW CELLS
### DO NOT ADD OR CREATE ANY NEW CELLS
#### DO NOT ADD OR CREATE ANY NEW CELLS

### YOU HAVE TO RUN ALL THESE CELLS BEFORE MOVING ON TO YOUR QUESTIONS. IF YOU ENCOUNTER ANY ERRORS JUST RESTART THE KERNEL

In [1]:
#Do not modify this cell
#Run this Cell
import pandas as pd
%load_ext sql

In [2]:
q1 = pd.read_csv('q1.csv', sep = '\t')
q2 = pd.read_csv('q2.csv', sep = '\t')
q3 = pd.read_csv('q3.csv', sep = '\t')
q4 = pd.read_csv('q4.csv', sep = '\t')
q5 = pd.read_csv('q5.csv', sep = '\t')

In [3]:
%sql sqlite:///bookstore.sqlite

# Here are your questions
You are the database administrator for an online bookstore. The bookstore database has several tables that store information about books, authors, customers, orders, and order items. Your task is to create a set of SQL queries to extract useful information from this database.
- The name of the table are authors, books, customers, order_items, orders, reviews
- Always start your answers with this line `%%sql result <<`. Each question has its own format. For example, Question One would be `%%sql q1_result <<` and so on like that.
- Then start writing your query on the next line for example, Question 2 would be
    ```
%%sql q2_result <<
    select * from orders
    ```

- If you do not follow these instructions your score will not count.

#### 1. Retrieve a list of the top 5 most popular books based on the number of times they have been ordered. Also order by author name in descending order

In [4]:
#Run this cell to see the expected output
#do not modify this cell
print('This is the expected output')
q1

This is the expected output

                                     title     author_name  order_count
0                                     1984   George Orwell            4
1           Adventures of Huckleberry Finn      Mark Twain            3
2                      Pride and Prejudice     Jane Austen            3
3                               The Hobbit  J.R.R. Tolkien            3
4  Harry Potter and the Philosophers Stone    J.K. Rowling            3

- **Your column names must match the expected output**
- **clear everything in the cell below and write your sql query there.** 
- Start your answer by typing this exactly as the first line.
```
%%sql q1_result <<

In [5]:
%%sql q1_result <<
SELECT 
    b.title AS title, 
    a.name AS author_name, 
    COUNT(order_items.book_id) AS order_count
FROM books AS b
JOIN
    authors AS a ON b.book_id = a.author_id
JOIN
    order_items ON b.book_id = order_items.book_id
GROUP BY title, author_name
ORDER BY order_count DESC, author_name DESC
LIMIT 5;

 * sqlite:///bookstore.sqlite
Done.
Returning data to local variable q1_result

In [6]:
#Run this cell to check your output
#do not modify this cell
print('This is the output of your query')
q1_result.DataFrame()

This is the output of your query

                                     title     author_name  order_count
0                                     1984   George Orwell            4
1           Adventures of Huckleberry Finn      Mark Twain            3
2                      Pride and Prejudice     Jane Austen            3
3                               The Hobbit  J.R.R. Tolkien            3
4  Harry Potter and the Philosophers Stone    J.K. Rowling            3

In [7]:
#do not modify this cell
assert q1_result.DataFrame().equals(q1)

#### 2. Calculate the total revenue generated by each author from the sales of their books.

In [8]:
#Run this cell to see the expected output
#do not modify this cell
print('This is the expected output')
q2['total_revenue'] = q2['total_revenue'].apply(lambda x: round(x, 2) )
q2

This is the expected output

      author_name  total_revenue
0   George Orwell         256.83
1    J.K. Rowling         213.88
2     Jane Austen         171.92
3  J.R.R. Tolkien          47.97
4      Mark Twain          26.97

- **Your column names must match the expected output**
- **clear everything in the cell below and write your sql query there.** 
- Start your answer by typing this exactly as the first line.
```
%%sql q2_result <<

In [9]:
%%sql q2_result <<
SELECT a.name AS author_name, SUM(order_items.quantity * b.price) AS total_revenue
FROM authors a
JOIN books AS b ON a.author_id = b.author_id
JOIN order_items ON b.book_id = order_items.book_id
GROUP BY author_name
ORDER BY total_revenue DESC;

 * sqlite:///bookstore.sqlite
Done.
Returning data to local variable q2_result

In [10]:
#Run this cell to check your output
#do not modify this cell
print('This is the output of your query')
q2result = q2_result.DataFrame()
q2result['total_revenue'] = q2result['total_revenue'].apply(lambda x: round(x, 2) )
q2result

This is the output of your query

      author_name  total_revenue
0   George Orwell         256.83
1    J.K. Rowling         213.88
2     Jane Austen         171.92
3  J.R.R. Tolkien          47.97
4      Mark Twain          26.97

In [11]:
#do not modify this cell
assert q2result.equals(q2)

#### 3. Identify the top 5 customers who have placed the most orders. Also order by customer name in descending order

In [12]:
#Run this cell to see the expected output
#do not modify this cell
print('This is the expected output')
q3

This is the expected output

   customer_name  order_count
0   David Wilson            6
1  Alice Johnson            6
2   Eva Martinez            5
3  Charlie Brown            4
4      Bob Smith            4

- **Your column names must match the expected output**
- **clear everything in the cell below and write your sql query there.** 
- Start your answer by typing this exactly as the first line.
```
%%sql q3_result <<

In [13]:
%%sql q3_result <<
SELECT name AS customer_name,
  (SELECT COUNT(order_id) authors
   FROM orders
   WHERE orders.customer_id = customers.customer_id) AS order_count
FROM customers
ORDER BY order_count DESC, customer_name DESC
LIMIT 5;

 * sqlite:///bookstore.sqlite
Done.
Returning data to local variable q3_result

In [14]:
#Run this cell to check your output
#do not modify this cell
print('This is the output of your query')
q3_result.DataFrame()

This is the output of your query

   customer_name  order_count
0   David Wilson            6
1  Alice Johnson            6
2   Eva Martinez            5
3  Charlie Brown            4
4      Bob Smith            4

In [15]:
#do not modify this cell
assert q3_result.DataFrame().equals(q3)

#### 4. Find all orders that contain book with book_id = 1.

In [16]:
#Run this cell to check your output
#do not modify this cell
print('This is the expected output')
q4

This is the expected output

   order_id  customer_name  order_date
0         1  Alice Johnson  2023-05-01
1         5   Eva Martinez  2023-05-05
2        13   Eva Martinez  2023-05-15
3        21  Charlie Brown  2023-06-20

- **Your column names must match the expected output**
- **clear everything in the cell below and write your sql query there.** 
- Start your answer by typing this exactly as the first line.
```
%%sql q4_result <<

In [17]:
%%sql q4_result <<
WITH book_order AS (
  SELECT order_items.order_id, order_items.book_id, customers.name AS customer_name, orders.order_date
  FROM order_items
  JOIN orders ON order_items.order_id = orders.order_id
  JOIN customers ON customers.customer_id = orders.customer_id
  )
SELECT order_id, customer_name, order_date
FROM book_order
WHERE book_id = 1

 * sqlite:///bookstore.sqlite
Done.
Returning data to local variable q4_result

In [18]:
#Run this cell to check your output
#do not modify this cell
print('This is the output of your query')
q4_result.DataFrame()

This is the output of your query

   order_id  customer_name  order_date
0         1  Alice Johnson  2023-05-01
1         5   Eva Martinez  2023-05-05
2        13   Eva Martinez  2023-05-15
3        21  Charlie Brown  2023-06-20

In [19]:
#do not modify this cell
assert q4_result.DataFrame().equals(q4)

#### 5. Select detailed review information of the Least 5 Books based on ratings, including book title, author name, review rating, and review text.

In [20]:
#Run this cell to see the expected output
#do not modify this cell
print('This is the expected output')
q5

This is the expected output

,review_id,book_title,author_name,rating,review_text
0,1,1984,George Orwell,5,A timeless masterpiece.
1,2,Pride and Prejudice,Jane Austen,4,A wonderful love story.
2,3,Harry Potter and the Philosophers Stone,J.K. Rowling,5,An incredible journey of magic and friendship.
3,4,Adventures of Huckleberry Finn,Mark Twain,4,A fascinating adventure.
4,5,The Hobbit,J.R.R. Tolkien,5,An epic tale of heroism.

- **Your column names must match the expected output**
- **clear everything in the cell below and write your sql query there.** 
- Start your answer by typing this exactly.
```
%%sql q5_result <<

In [21]:
%%sql q5_result <<
SELECT 
    reviews.review_id, 
    b.title AS book_title, 
    a.name AS author_name, 
    reviews.rating, 
    reviews.review_text
FROM reviews
JOIN books AS b ON reviews.book_id = b.book_id
JOIN authors AS a ON b.author_id = a.author_id
GROUP BY author_name
ORDER BY review_id
LIMIT 5;

 * sqlite:///bookstore.sqlite
Done.
Returning data to local variable q5_result

In [22]:
#Run this cell to check your output
#do not modify this cell
print('This is the output of your query')
q5_result.DataFrame()

This is the output of your query

,review_id,book_title,author_name,rating,review_text
0,1,1984,George Orwell,5,A timeless masterpiece.
1,2,Pride and Prejudice,Jane Austen,4,A wonderful love story.
2,3,Harry Potter and the Philosophers Stone,J.K. Rowling,5,An incredible journey of magic and friendship.
3,4,Adventures of Huckleberry Finn,Mark Twain,4,A fascinating adventure.
4,5,The Hobbit,J.R.R. Tolkien,5,An epic tale of heroism.

In [23]:
#do not modify this cell
assert q5_result.DataFrame().equals(q5)